package homeworks.homework_12;

public class Hw12Task2 {
    public static void main(String[] args) {
//        Task 2
//        Найдите в Интернете данные по температуре в вашем городе за прошедшую неделю (или придумайте :) ).
//
//        Вычислите среднюю температуру за неделю и выведите ее на печать.
//        P.S. - правильно выберите типы данных
        float avWeekTemp = (5 + 4 + (-2) + 0 + (-1) + 2 + 2) / (float) 7;
        System.out.printf("Средняя температура за неделю: %.1f градусa", avWeekTemp);
    }
}
