//Task 01.
//Создать в IntelliJ IDEA проект.
//Добавить в проект пакет lesson_11 и homework_11
//В пакете homework_11 создать файл класса Task1.java
//создать в классе метод main
//в метод main написать код, выводящий на экран "Hello, World!"
//Запустить метод main средствами IntelliJ IDEA


package homeworks.homework_11;

public class Task1 {

    public static void main(String[] args) {
        System.out.println("Hello, World!");
    }

}
